docs/RforS-1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"https://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="https://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-05-26 水 06:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc004667">1. 基本的な操作</a>
<ul>
<li><a href="#org8eb4ef6">1.1. 目標</a></li>
<li><a href="#orgce5cc9c">1.2. 1章</a>
<ul>
<li><a href="#org90cd140">1.2.1. 基本的な操作の概要 1.4.2</a></li>
<li><a href="#orgbded42e">1.2.2. Rをもっとさわってみよう 1.5  R-Source::ベクトルの作成   - R解説(2)</a></li>
<li><a href="#org159722b">1.2.3. 複数の値をまとめて使う R-Source</a></li>
<li><a href="#org49386c5">1.2.4. 関数を作ってみよう     R-Source::関数事始</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgc004667" class="outline-2">
<h2 id="orgc004667"><span class="section-number-2">1</span> 基本的な操作</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org8eb4ef6" class="outline-3">
<h3 id="org8eb4ef6"><span class="section-number-3">1.1</span> 目標</h3>
<div class="outline-text-3" id="text-1-1">
<p>
R で書かれたコードを読めるようになりましょう。
</p>

<ul class="org-ul">
<li>式を理解しましょう</li>
<li>関数を理解しましょう</li>
<li>ベクトルを知りましょう</li>
</ul>
</div>
</div>

<div id="outline-container-orgce5cc9c" class="outline-3">
<h3 id="orgce5cc9c"><span class="section-number-3">1.2</span> 1章</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org90cd140" class="outline-4">
<h4 id="org90cd140"><span class="section-number-4">1.2.1</span> 基本的な操作の概要 1.4.2</h4>
<div class="outline-text-4" id="text-1-2-1">
</div>
<ol class="org-ol">
<li><a id="org24fa237"></a>R または RStudio の起動と終了 <a href="https://cse.naro.affrc.go.jp/takezawa/r-tips/r/02.html">R-Source</a><br />
<ol class="org-ol">
<li><a id="orgc81221b"></a>開始<br />
<div class="outline-text-6" id="text-1-2-1-1-1">
<div class="org-src-container">
<pre class="src src-shell">R --save
</pre>
</div>
</div>
</li>

<li><a id="orgd63451e"></a>R はインタープリタ<br />
<div class="outline-text-6" id="text-1-2-1-1-2">
<ul class="org-ul">
<li>ユーザがプログラムを入力し，</li>
<li>R システムが入力プログラムを実行し，結果を表示する</li>
<li>上矢印，下矢印で前の式を呼び出し，エンターで実行</li>
<li>history() で入力式一覧</li>
</ul>
</div>
</li>


<li><a id="orgdb78af4"></a>終了<br />
<div class="outline-text-6" id="text-1-2-1-1-3">
<div class="org-src-container">
<pre class="src src-R"># quit()
</pre>
</div>
</div>
</li>
</ol>
</li>

<li><a id="orga7667e3"></a>簡単な計算   <a href="https://cse.naro.affrc.go.jp/takezawa/r-tips/r/03.html">R-Source::簡単な計算 </a> <a href="https://whitewell.sakura.ne.jp/R/Rintro-01.html">R解説(1)</a><br />
<ol class="org-ol">
<li><a id="org4817ecd"></a>四則演算  <a href="https://cse.naro.affrc.go.jp/takezawa/r-tips/r/03.html">R-Source::簡単な計算 </a><br />
<div class="outline-text-6" id="text-1-2-1-2-1">
<div class="org-src-container">
<pre class="src src-R">
3+5
10-3
2*3
20/4 # 割り算をするときは/ (スラッシュ)
21 %/% 5
21 %% 5

</pre>
</div>

<pre class="example">
[1] 8
[1] 7
[1] 6
[1] 5
[1] 4
[1] 1
</pre>
</div>
</li>


<li><a id="orgcbd8527"></a><a href="https://whitewell.sakura.ne.jp/R/Rintro-01.html">R解説(1)</a> の課題をやってみましょう<br /></li>
</ol>
</li>

<li><a id="orgb05dd1e"></a>関数   <a href="https://cse.naro.affrc.go.jp/takezawa/r-tips/r/27.html">R-Source::関数事始</a><br />
<ol class="org-ol">
<li><a id="orgd022aa1"></a>平方根を求める<br />
<div class="outline-text-6" id="text-1-2-1-3-1">
<div class="org-src-container">
<pre class="src src-R">
sqrt(16) * sqrt(99) + sqrt(1)

</pre>
</div>

<pre class="example">
[1] 40.7995
</pre>


<ul class="org-ul">
<li>sqrt が関数の名前，(16) が関数に渡す *引数*。</li>
</ul>
</div>
</li>

<li><a id="orgd1e2c58"></a>底が10の対数<br />
<div class="outline-text-6" id="text-1-2-1-3-2">
<div class="org-src-container">
<pre class="src src-R">
log(10, base=10)

</pre>
</div>

<pre class="example">
[1] 1
</pre>


<div class="org-src-container">
<pre class="src src-R"># help(log)
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</div>


<div id="outline-container-orgbded42e" class="outline-4">
<h4 id="orgbded42e"><span class="section-number-4">1.2.2</span> Rをもっとさわってみよう 1.5  <a href="https://cse.naro.affrc.go.jp/takezawa/r-tips/r/12.html">R-Source::ベクトルの作成</a>   - <a href="https://whitewell.sakura.ne.jp/R/Rintro-02.html">R解説(2)</a></h4>
<div class="outline-text-4" id="text-1-2-2">
<div class="org-src-container">
<pre class="src src-R">
(height &lt;- c(173,178,180,183,182,174,179,179,174,192)) # ベクトル化

summary(height)

</pre>
</div>

<pre class="example">
[1] 173 178 180 183 182 174 179 179 174 192
  Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
 173.0   175.0   179.0   179.4   181.5   192.0
</pre>


<dl class="org-dl">
<dt>c(173,178,180,183,182,174,179,179,174,192)</dt><dd>10個の要素を持つベ
クトルを作る (関数のよびだし)</dd>

<dt>与えられたデータの統計代表値</dt><dd><dl class="org-dl">
<dt>Min.</dt><dd>最小値</dd>
<dt>1st Qu.</dt><dd>第一四分位数 (下から1/4点)</dd>
<dt>Median</dt><dd>中央値</dd>
<dt>Mean</dt><dd>平均値</dd>
<dt>3rd Qu.</dt><dd>第三四分位数 (下から3/4点)</dd>
<dt>Max.</dt><dd>最大値</dd>
</dl></dd>
</dl>
</div>
</div>

<div id="outline-container-org159722b" class="outline-4">
<h4 id="org159722b"><span class="section-number-4">1.2.3</span> 複数の値をまとめて使う <a href="https://cse.naro.affrc.go.jp/takezawa/r-tips/r/05.html">R-Source</a></h4>
<div class="outline-text-4" id="text-1-2-3">
</div>
<ol class="org-ol">
<li><a id="org6216610"></a>10人分のデータにまとめて名前をつける  <a href="https://cse.naro.affrc.go.jp/takezawa/r-tips/r/12.html">R-Source::ベクトルの作成</a> <a href="https://cse.naro.affrc.go.jp/takezawa/r-tips/r/05.html">R-Source::オブジェクトと代入</a><br />
<div class="outline-text-5" id="text-1-2-3-1">
<div class="org-src-container">
<pre class="src src-R">
(身長 &lt;- c(173,178,180,183,182,174,179,179,174,192))

</pre>
</div>

<pre class="example">
[1] 173 178 180 183 182 174 179 179 174 192
</pre>



<ul class="org-ul">
<li>「身長」という名前の変数に10人分のデータを格納している
<ul class="org-ul">
<li>変数は，名前と値を持つ</li>
<li>名前で，参照し，</li>
<li>参照すると値がでてくる</li>
</ul></li>

<li>「変数 &lt;- 式」という構文を代入という</li>
</ul>
</div>
</li>

<li><a id="org89d8246"></a>変数を使う <a href="https://cse.naro.affrc.go.jp/takezawa/r-tips/r/05.html">R-Source::オブジェクトと代入</a><br />
<div class="outline-text-5" id="text-1-2-3-2">
<div class="org-src-container">
<pre class="src src-R">
身長

</pre>
</div>

<pre class="example">
[1] 173 178 180 183 182 174 179 179 174 192
</pre>
</div>
</li>

<li><a id="org779a1f6"></a>行列を使う <a href="https://cse.naro.affrc.go.jp/takezawa/r-tips/r/19.html">R-Source::行列の生成</a><br />
<div class="outline-text-5" id="text-1-2-3-3">
<div class="org-src-container">
<pre class="src src-R">
(ホークス &lt;- matrix(
  c(173,178,180,183,182,174,179,179,174,192,
    17000,14000,9000,50000,30000,12000,900,2100,1000,2500),
  10, 2))

</pre>
</div>

<pre class="example" id="orgb929a80">
      [,1]  [,2]
 [1,]  173 17000
 [2,]  178 14000
 [3,]  180  9000
 [4,]  183 50000
 [5,]  182 30000
 [6,]  174 12000
 [7,]  179   900
 [8,]  179  2100
 [9,]  174  1000
[10,]  192  2500
</pre>
<dl class="org-dl">
<dt>matrix(ベクトル，行数，列数)</dt><dd>ベクトルを 行数×列数 の行列に
する</dd>
</dl>
</div>
</li>

<li><a id="orgccf4606"></a>外部データファイルを読み込む<br />
<div class="outline-text-5" id="text-1-2-3-4">
<p>
<a href="https://cse.naro.affrc.go.jp/takezawa/r-tips/r/40.html">R-Source::ファイルからデータを読み込む</a>
</p>

<ul class="org-ul">
<li><p>
作業ディレクトリ <a href="https://cse.naro.affrc.go.jp/takezawa/r-tips/r/06.html">R-Source::作業ディレクトリの変更</a>
</p>

<p>
ファイルからデータやプログラムを読み込んだり，ファイルにデータ
を書き出したりする場所を作業ディレクトリという
</p></li>
</ul>

<div class="org-src-container">
<pre class="src src-R">setwd("~/Lects/R")
getwd()
system("ls")
</pre>
</div>

<pre class="example">
 setwd("~/Lects/R") でエラー:  作業ディレクトリを変更できません
[1] "/nas/home/masayuki/COMM/Lects/R"
2020-repo-01.org  R-learning.org~   binom.r		      r-plot.png
2020-repo-02.org  RforStatistcs     dist-uniform.r	      stat-12.org
2020-repo-03.org  Rintro	    gauss3d-rot.r	      stat-12.org~
3.log		  Rplots.pdf	    gauss3d.R		      stat-lse.org
3.ps		  Rprobability.org  gauss3d.org		      www.medi-08-data-06.work
3.tex		  ai-trend	    graphs
R-learning.org	  babel		    low_of_large_numbers.org
</pre>


<div class="org-src-container">
<pre class="src src-R">
(ホークス.2 &lt;- read.csv("Data/hawks.csv"))

</pre>
</div>

<pre class="example">
file(file, "rt") でエラー:  コネクションを開くことができません 
追加情報:  警告メッセージ: 
file(file, "rt") で: 
  ファイル 'Data/hawks.csv' を開くことができません: そのようなファイルやディレクトリはありません
</pre>
</div>
</li>
</ol>
</div>



<div id="outline-container-org49386c5" class="outline-4">
<h4 id="org49386c5"><span class="section-number-4">1.2.4</span> 関数を作ってみよう     <a href="https://cse.naro.affrc.go.jp/takezawa/r-tips/r/27.html">R-Source::関数事始</a></h4>
<div class="outline-text-4" id="text-1-2-4">
</div>
<ol class="org-ol">
<li><a id="org2909a26"></a>標本分散を計算する関数を作る<br />
<div class="outline-text-5" id="text-1-2-4-1">
<p>
Rの var() 関数は，不偏分散を計算する関数なので，
標本分散を計算する関数を定義してみる:
</p>

<div class="org-src-container">
<pre class="src src-R">
(varp &lt;- function (x) {
  var(x)*(length(x)-1)/length(x)
})

</pre>
</div>

<pre class="example">
function (x) {
  var(x)*(length(x)-1)/length(x)
}
</pre>


<div class="org-src-container">
<pre class="src src-R">
(x &lt;- c(10, 13, 8, 15, 8))
var(x)
varp(x)

</pre>
</div>

<pre class="example">
[1] 10 13  8 15  8
[1] 9.7
[1] 7.76
</pre>
</div>
</li>


<li><a id="org83792e1"></a>プログラムを読み込む<br />
<div class="outline-text-5" id="text-1-2-4-2">
<div class="org-src-container">
<pre class="src src-R">
setwd("~/COMM/Lects/R/mylib/")
getwd()
system("ls")
(source("varp.r"))

</pre>
</div>

<pre class="example">
[1] "/nas/home/masayuki/COMM/Lects/R/mylib"
varp.r
$value
function (x) {
  var(x)*(length(x)-1)/length(x)
}

$visible
[1] TRUE
</pre>
</div>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-05-26 水 06:30</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
